In [1]:
# Add the magic
%matplotlib inline

In [3]:
#Add in the dependencies

import matplotlib.pyplot as plt
import numpy as np
import statistics
import pandas as pd

In [10]:
#Files to load

#city_data_to_load =pd.read_csv("Resources/city_data.csv")

#ride_data_to_load =pd.read_csv("Resources/ride_data.csv")

In [11]:
#reminder, another way importing the csv is by

import os 

city_data_to_load ="Resources/city_data.csv"

ride_data_to_load ="Resources/ride_data.csv"

In [12]:
#Use the pd.read_csv() then store files into a Pandas Dataframes

In [13]:
#Create the Dataframes 
city_data_df =pd.read_csv(city_data_to_load)

ride_data_df=pd.read_csv(ride_data_to_load)

In [14]:
#Read city_data_df
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [15]:
#Read the ride_data_df
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [16]:
#5.2.4 Inspect the Data

In [18]:
#Begin by findinf all the rows thats are not null by:
    # count() method or
    # isnull().sum() method chaining
    
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [19]:
#Run the cell, and you'll see that the output shows the data types for each column. 
#Most importantly, the data type for the driver_count column is an integer

In [20]:
#Find the well check how many data points there are for city type

In [22]:
#Get the unique value for the type of city using the .unique() method

city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [23]:
# Now use the sum()method for the type column where the condition is = to either of the 3 cat.

In [37]:
#Get the number of data points from the Urban cities

urban_sum = sum(city_data_df["type"]=="Urban")

urban_sum

66

In [30]:
#Get the sum of both Rural citites

rural_sum= sum(city_data_df["type"]=="Rural")

rural_sum

18

In [32]:
#Get the sum of Suburban cities

suburban_sum= sum(city_data_df["type"]=="Suburban")

suburban_sum

36

In [38]:
#Inspect Ride Data DataFrame

In [40]:
#Get the rows and colums that are not null

ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [41]:
#no null values

In [42]:
#Next, we need to determine if the fare and ride_id columns are numerical data types 
#so that we can perform mathematical calculations on those columns.

#Get the data types for each column

ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [43]:
#mhmm yep looks like everything is in order

In [44]:
#Now to merge the DF'S
    #Real quick tho le's review

In [45]:
#Before we merge the DataFrames, let's review each DataFrame.

    #The columns in the city_data_df DataFrame are:

        #city
        #driver_count
        #type
        
    #The columns in the ride_data_df are:

        #city
        #date
        #fare
        #ride_id

In [48]:
#Combine the data into a single dataset

pyber_data_df = pd.merge(ride_data_df, city_data_df, how ='left', on= ['city','city'])

In [49]:
#Now that that checks out
#Display the DataFrame :)

In [51]:
pyber_data_df.head(10)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
5,South Latoya,2019-03-11 12:26:48,9.52,1994999424437,10,Urban
6,New Paulville,2019-02-27 11:17:56,43.25,793208410091,44,Urban
7,Simpsonburgh,2019-04-26 00:43:24,35.98,111953927754,21,Urban
8,South Karenland,2019-01-08 03:28:48,35.09,7995623208694,4,Urban
9,North Jasmine,2019-03-09 06:26:29,42.81,5327642267789,33,Urban

In [52]:
#In the pyber_data_df DataFrame, all the columns from the city_data_df are the first four columns after the index.

#The driver_count and type columns from the ride_data_df are added at the end

In [53]:
#5.2.5 Commit your code